#+title: Journal 2024
#+author: Olivier leroy


* <2024-01-01 Mon>

Nouvelle annee, resolution tenir le journal jusqu'au bout et transformer certains partie en memo (blog post?)

- ne pas distinguer le journal du taff du perso
- pas encore certains d'utiliser org roam + un journal a voir

** org mod :org:mode:

    Utiliser plus souvent les tags ref: https://orgmode.org/guide/Tags.html

** building repro analytical pipeline :rstats:

*** chapitre 4:

Pedagogique, sans doute tres utile pour un etudiant et/ou un jeune DA

Chose nouvelle apprise: ~git stash~

Permet de revenir as ~HEAD~

#+begin_src bash
mkdir temp/
cd temp
git init
echo "bob" > unfichier.txt
git add .
git commit -m "init"
rm unfichier.txt
git add .
git stash
cd ..
rm -rf temp
#+end_src

#+RESULTS:
| Reinitialized | existing | Git       | repository | in    | /Users/olivierleroy/Documents/oli/prise_de_notes/temp/.git/ |     |    |         |         |      |
| On            | branch   | master    |            |       |                                                           |     |    |         |         |      |
| nothing       | to       | commit,   | working    | tree  | clean                                                     |     |    |         |         |      |
| Saved         | working  | directory | and        | index | state                                                     | WIP | on | master: | 5c5c45b | init |

*trunk base development* :  https://trunkbaseddevelopment.com/

On vera sans doute plus tard mais en gros on dev sur dev et fork des releases qui elles sont stables.


* <2024-01-02 Tue>

** chapitre 5 reproducible pip R :rstats:

trunk based dev: en gros des commits tres frequents, faciliter par de la double revision. L'objectif est de diviser le development en petite taches permettant de petite commit, dev sur une autre branche et merger rapidement.

Dans le cas de taches importantes il est recommande d'utiliser une technique appelle "branch bt abstraction" qui consiste a utiliser des placeholders qui seront ameliore petit a petit. (https://martinfowler.com/bliki/BranchByAbstraction.html)

Le tronc est sense etre toujours "production rdy"

l'obligation de sousmettre une PR pourmodifier le tronc renforce cette pratique

*** BEAD :mbtiles:PG:

pas d option de filter sur un array dans mbtiles

bcp de wrangling pour former un jeux de donnees test, pas mal de changement de specs,

les fonctions d'aggregation de PG peuvent prendre un order by et un distinct:

~json_agg('isp_id' || ' ' || isp_id order by isp_id) as isp_num~

** TED

vue metadata avec Dolley
